nxp-mcuxpresso/mcux-soc-svd/MCXA255/MCXA255.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTIMER3CAP[%s]</name>
          <description>Capture select register for CTIMER inputs</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number for CTIMER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>CT_INP0 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>CT_INP1 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>CT_INP2 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>CT_INP3 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>CT_INP4 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CT_INP5 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CT_INP6 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>CT_INP7 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CT_INP8 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CT_INP9 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CT_INP10 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CT_INP11 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CT_INP12 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CT_INP13 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>CT_INP14 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>CT_INP15 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>CT_INP16 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>CT_INP17 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>CT_INP18 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>CT_INP19 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>USB0 usb0 start of frame input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>AOI0_OUT1 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>AOI0_OUT2 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>AOI0_OUT3 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>ADC0_tcomp[0]</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>ADC0_tcomp[1]</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>ADC0_tcomp[2]</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>ADC0_tcomp[3] input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>CMP0_OUT is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>CMP1_OUT is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>CMP2_OUT is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>CTimer0_MAT1 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>CTimer1_MAT1 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>QDC0_CMP_FLAG0 is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>QDC0_CMP_FLAG1 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>QDC0_CMP_FLAG2 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>QDC0_CMP_FLAG3 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>QDC0_POS_MATCH0 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>PWM0_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>PWM0_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>PWM0_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>PWM0_SM3_MUX_TRIG0 input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>LPI2C0 Master End of Packet input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>LPI2C0 Slave End of Packet input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>LPI2C1 Master End of Packet input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>LPI2C1 Slave End of Packet input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>LPSPI0 End of Frame input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>LPSPI0 Received Data Word input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>LPSPI1 End of Frame input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>LPSPI1 Received Data Word input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>LPUART0 Received Data Word input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>LPUART0 Transmitted Data Word input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>LPUART0 Receive Line Idle input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>LPUART1 Received Data Word input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>LPUART1 Transmitted Data Word input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>LPUART1 Receive Line Idle input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>LPUART2 Received Data Word input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>LPUART2 Transmitted Data Word input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>LPUART2 Receive Line Idle input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>LPUART3 Received Data Word input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>LPUART3 Transmitted Data Word input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>LPUART3 Receive Line Idle input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>LPUART4 Received Data Word input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>LPUART4 Transmitted Data Word input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>LPUART4 Receive Line Idle input is selected</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val71</name>
                  <description>AOI1_OUT0 input is selected</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val72</name>
                  <description>AOI1_OUT1 input is selected</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val73</name>
                  <description>AOI1_OUT2 input is selected</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val74</name>
                  <description>AOI1_OUT3 input is selected</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>ADC1_tcomp[0] input is selected</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val76</name>
                  <description>ADC1_tcomp[1] input is selected</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val77</name>
                  <description>ADC1_tcomp[2] input is selected</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val78</name>
                  <description>ADC1_tcomp[3] input is selected</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val79</name>
                  <description>CTimer2_MAT1 input is selected</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val80</name>
                  <description>CTimer2_MAT2 input is selected</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val81</name>
                  <description>CTimer2_MAT3 input is selected</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val82</name>
                  <description>CTimer4_MAT1 input is selected</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val83</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val84</name>
                  <description>CTimer4_MAT3 input is selected</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val85</name>
                  <description>QDC1_CMP_FLAG0 input is selected</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val86</name>
                  <description>QDC1_CMP_FLAG1 input is selected</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val87</name>
                  <description>QDC1_CMP_FLAG2 input is selected</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val88</name>
                  <description>QDC1_CMP_FLAG3 input is selected</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val89</name>
                  <description>QDC1_POS_MATCH0 input is selected</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val90</name>
                  <description>PWM1_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val91</name>
                  <description>PWM1_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val92</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val93</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val94</name>
                  <description>LPI2C2 Master End of Packet input is selected</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val95</name>
                  <description>LPI2C2 Slave End of Packet input is selected</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val96</name>
                  <description>LPI2C3 Master End of Packet input is selected</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val97</name>
                  <description>LPI2C3 Slave End of Packet input is selected</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val98</name>
                  <description>LPUART5 Received Data Word input is selected</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val99</name>
                  <description>LPUART5 Transmitted Data Word input is selected</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val100</name>
                  <description>LPUART5 Receive Line Idle input is selected</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val105</name>
                  <description>ADC2_tcomp[0] input is selected</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val106</name>
                  <description>ADC2_tcomp[1] input is selected</description>
                  <value>0x6A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val107</name>
                  <description>ADC2_tcomp[2] input is selected</description>
                  <value>0x6B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val108</name>
                  <description>ADC2_tcomp[3] input is selected</description>
                  <value>0x6C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val109</name>
